""" Команды для работы с сайтом PyPI.org """

# pip search <ключевое слово> - найти пакет на PyPI с этим словом
# pip install <имя пакета> - установить последнюю версию пакета
# pip install <имя пакета>==1.2.3 - установить версию пакета 1.2.3
# pip install --upgrade <имя пакета> - обновить версию установленного пакета до последней
# pip install --upgrade <имя пакета>==1.2.3 - обновить версию установленного пакета до указанной
# pip uninstall <имя пакета> - удалить пакета
# pip freeze - выдать список установленных пакетов с версиями
# pip freeze > requerements.txt - создать файл, в котором указаны все пакеты с версиями
# pip install -r requerements.txt - установить все пакеты указанных версий